Homework/ComputerOrganization/Hw6/Homework6.org
#+OPTIONS: \t:t ':nil *:t -:t ::t <:t H:3 \n:t ^:t arch:headline author:t
#+OPTIONS: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t tags:t
#+OPTIONS: tasks:t tex:t timestamp:t title:t toc:nil todo:t |:t
#+TITLE: Cs252 Homework 5
#+DATE: <2019-04-09 Wed>
#+AUTHOR: Parker Gabel
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 26.1 (Org mode 9.1.9)
* 1.d
** sll forwards to the MEM register
** sub forwards to the WB register
** sll forwards to the WB register
** sub forwrds to the MEM register
* 2.f
** No Forwarding
This sequence has two dependencies, instruction 3 and 4. So there is a
stall on instruction 2. Thus instruction 2 is in the WB phase. So on
the 7th clock cycle instruction 3 is in the EX phase. The 4th
instruction must be stalled in the ID phase.
** With Forwarding
With forwarding there is no stalls as there is no lw instruction. So
all of the instruction execute without stalls. By clock cycle 7
instruction 3 is in the WB phase and instruction 4 is in MEM.
